class Exercise02_Operation{
	public static void main(String[] args) 	{
		//ÃÑ 3ÁÙÀ» Ãâ·ÂÇÏ´Â ÇÁ·Î±×·¥
		//ÇÑ±ÛÀÚÀ½ºÎºÐÀº ¤¡ ???? ¤¾ ??? À¸·Î ÃÑ ???°³ µî·ÏµÇÀÖ°í,
		//ÇÑ±Û¸ðÀ½ºÎºÐÀº '¤¿'´Â ???? À¸·Î l´Â ???À¸·Î ÃÑ ???°³ µî·ÏµÇÀÖ°í,
		///ÇÑ±Û¿Ï¼ºÇü¹®ÀÚ´Â °¡´Â ??? ÆRÀº ???À¸·Î ÃÑ ????°³ µî·ÏµÇÀÖ´Ù.
		/*
		System.out.println('¤¡'+0); // 12593
		System.out.println('¤¾'+0); // 12622

		System.out.println('¤¿'+0); // 12623
		System.out.println('¤Ó'+0); // 12643

		System.out.println('°¡'+0); // 44032
		System.out.println('ÆR'+0); // 55203
		*/
		System.out.println("ÇÑ±ÛÀÚÀ½ºÎºÐÀº ¤¡Àº "
				+ ('¤¡'+0) +", ¤¾Àº " + ('¤¾'+0)+"À¸·Î ÃÑ "+(('¤¾'-'¤¡')+1)+"°³ µî·ÏµÇÀÖ°í");
		System.out.println("ÇÑ±Û¸ðÀ½ºÎºÐÀº ¤¿Àº "
				+ ('¤¿'+0) +", ¤ÓÀº " + ('¤Ó'+0)+"À¸·Î ÃÑ "+(('¤Ó'-'¤¿')+1)+"°³ µî·ÏµÇÀÖ°í");
		System.out.println("ÇÑ±Û¿Ï¼ºÇü¹®ÀÚ´Â °¡´Â "
				+ ('°¡'+0) +", ÆRÀº " + ('ÆR'+0)+"À¸·Î ÃÑ "+(('ÆR'-'°¡')+1)+"°³ µî·ÏµÇÀÖ´Ù.");

		
		
		System.out.println("¤¡À¸·Î ½ÃÀÛµÇ´Â ¿Ï¼ºÇü¹®ÀÚ´Â °¡´Â "
				+ ('°¡'+0) +", ³ª´Â " + ('³ª'+ 0)+"À¸·Î ÃÑ "+('³ª'-'°¡')+"°³ µî·ÏµÇÀÖ´Ù."); //ºó°ø°£¾ø´Ù°¡Á¤ÇÏ¿¡
		
		System.out.println( (char)(45207)); // ¤¡ ³¡±ÛÀÚ …É

	}
}
