class Exercise01_Operation {
	public static void main(String[] args) 	{
		// 1. 하루가 몇초인가?
		//	24시 * 60분 * 60초 = 86400
		System.out.println("1 : "+24*60*60+"초");

		// 2. 현재 지금 21시 06분 이라고 가정, 하루로 봤을때 몇초째(범위)인가?
		//  (21*60+6)*60 ~ +59
		System.out.println("2 : "+((21*60)+6)*60 +"~"+ 76019); // 75960 ~ 76019  
		
		// 2-1. 24시간을 1이라 봤을때, 지금은 몇인가?
		System.out.println("3 : "+75960.0/86400.0); //0.8791666666666667
		

		// 3. 하루가 시작하고 지금 총 누적 흘러간 초가 4753625 이 값일때
		//    몇시 몇분 몇초인가?
		//System.out.println(4753625/86400); //흘러간 일수 55
		//System.out.println(4753625-(86400*55)); // 55일 + 1625초
		//System.out.println(1625/60); //55일 + 27분
		//System.out.println(1625-(27*60)); // 55일 + 27분 + 5초
		// 80825로 수 변경됨

		System.out.println(80825/(60*60)) ; //1347분 --> 22시
		System.out.println((80825-(60*60*22))/60); //나머지 1625초 -> 27분
		System.out.println(80825/(60*60) + " 시 "+ (80825-(60*60*22))/60 +" 분 "+(80825-(60*60*22))%60+" 초 ");


		System.out.println("-----------------------------------------------------------");
		// 1. 하루가 몇초인가?  ==> 86400
		//    60*60*24 연산의 결과
		
		// 2. 현재 시간 21시06분 이라고 가정, 하루로 봤을때 이건 몇초인가? (범위/가능성 시작값 ~ 끝값)
		//	  ==> 21*60*60+6*60   ,21*60*60+7*60 -1
		
		// 2-1. 24시간(하루)을 1이라고 봤을때, 지금은 수치가 몇인가?
		System.out.println(  1.0 * (21*60*60 + 6*60 ) / (60*60*24) );
		System.out.println( 1.0 * (21 * 60*60 + 6*60 + 59 ) / (60*60*24));

		System.out.println( (21 * 60*60 + 6*60 + 59 ) / (60*60*24) * 1.0);	// 잘못된 계산

		// 3. 하루가 시작하고 지금 총 누적 흘러간 초의 수치가 80825 이 값일때
		//    몇시 몇분 몇초인가?
		System.out.println( 80825 / (60*60) );
		System.out.println( 80825 - (80825 / (60*60) * (60*60) ) );
		System.out.println( 80825 % (60*60)  );


		System.out.println( 80825 % (60*60)  / 60);
		System.out.println( 80825 % (60*60)  % 60);
		/*
		1 : 86400초
		2 : 75960~76019
		3 : 0.8791666666666667
		22
		27
		22 시 27 분 5 초
		-----------------------------------------------------------
		0.8791666666666667
		0.879849537037037
		0.0
		22
		1625
		1625
		27
		5
		*/
	}
}



	
