package java_plus;

public class Chap05_2_반복문_while {
	/*
	 2. while
	  1) for 문과 달리 반복횟수를 정확히 알지 못할 때 주로 사용
	  2) 무한 루프 주의
	  3) break;		--> 현재 실행하고 있는 구문(반복문, 조건문)에서 빠져나온다
	  4) continue;	--> 현재 실행하고 있는 구문(반복문)에서 위로 다시 올라간다
	  				예외 상황으로 많이 사용 --> 증감의 위치에 조심해야 한다.
	  				
	  while(조건)
	  {
	  		//반복프로세스
	  }
	  
	  do{
	  		//반복프로세스
	  		 
	  }while(조건); 
	  
	  --> 구간안의 내용은 최초 1번 실행하고 조건문에서 더 반복시킬지를 확인한다	  
	 */
	public static void main(String[] args) {
		/**
		 * @param args
		 */
		int a=0; //사용자가 변수, 초기값을 지정
		while(a<5) {
			a++; // 증감형태를 명시
			
			if(a==3)
				continue; //이 구문이 실행되면 이하의 것은 실행하지 않고 위로 올라감
			
			//break; //switch 에서 처럼 이 구문을 만나면 빠져나온다.
					 //for문도 마찬가지
			
			System.out.println("a 값 : "+a);
			
		}
		
		int k=5; //do~ while문에서는 초기값을 주지 않아도 돌아간다
		
		do {
			//k=5; //만일 초기값을 지정하지 않은 경우
			       //초기값을 구문 안에서 초기화 해주어야 한다.
			       //--> 이경우 반복시 값을 변경시키기 때문에 위험하다
			System.out.println("한번은 돌아가요"+k);
			//조건에 맞지 않아도 실행
		}while(k-->0);
		// (k--)>0 (형태에 주의할것)
	}
	
}
