class Exercise02_Operation {
	public static void main(String[] args) {
		// ÃÑ 3ÁÙÀ» Ãâ·ÂÇÏ´Â ÇÁ·Î±×·¥
		// ÇÑ±ÛÀÚÀ½ºÎºÐÀº ¤¡Àº ???? À¸·Î  ¤¾Àº ???? À¸·Î ÃÑ ??? °³ µî·ÏµÇÀÖ°í,
		// ÇÑ±Û¸ðÀ½ºÎºÐÀº ¤¿´Â ???? À¸·Î  ¤Ó´Â ???? À¸·Î ÃÑ ??? °³ µî·ÏµÇÀÖ°í,
		// ÇÑ±Û¿Ï¼ºÇü¹®ÀÚ °¡ ´Â ???? À¸·Î  ÆRÀº ???? À¸·Î  ÃÑ ???? °³ µî·ÏµÇÀÖ´Ù.

//		System.out.println("¿Ï¼ºÇü¹®ÀÚ: °¡=" + '°¡'*1 +"~ÆR="+ ('ÆR'+0) +" : ÃÑ "+ ('ÆR'-'°¡'+1) +"°³" );
//		System.out.println("¿Ï¼ºÇü¹®ÀÚ: °¡=" + '°¡'*1 +"~ÆR="+ ('ÆR'+0) +" : ÃÑ "+ ('ÆR'-'°¡'+1) +"°³" );
		System.out.println("¿Ï¼ºÇü¹®ÀÚ: °¡=" + '°¡'*1 +"~ÆR="+ ('ÆR'+0) +" : ÃÑ "+ ('ÆR'-'°¡'+1) +"°³" );

		System.out.println("¿Ï¼ºÇü¹®ÀÚ: °¡=" + '°¡'*1 +"~³ª="+ ('³ª'+0) +" : ÃÑ "+ ('³ª'-'°¡') +"°³" );

		System.out.println( (char)45207 );	// 

	}
}
