/*
 *  ∏ﬁ¿Œ »Â∏ß∞˙ ∫∞µµ∑Œ ¿€µø«œ¥¬ ¥Ÿ∏• »Â∏ß¿Ã « ø‰«œ∏È,
 *  ∞¥√º∏¶ º≥∞Ë«“∂ß, extends Thread
 */

class CharPrint extends Thread{
	char start;
	char end;
	CharPrint(char s, char e){
		start = s;
		end = e;		
	}
	@Override
	public void run() { //∏ﬁ¿Œ¿∏∑Œ ∞£¡÷
		/*
		int cnt =0;
		for (char c = start; c < end; c++) {			
			synchronized (System.out) {
								
			}	
		}
		System.out.println();
		*/
		char c = start;
		while(c<end) {
			String str = "";
			for (int cnt = 1; cnt <= 20; cnt++) {	
				str += c++;				
				if(c==end)
					break;
			}
			synchronized (System.out) {
				System.out.println(getName()+" : "+str);
			//	System.err.println(getName()+" : "+str); //ø°∑Ø√‚∑¬
			}				
		}
	}
}

public class Source02_Thread {
	public static void main(String[] args) {
   //CharPrint t
		Thread t1 =new CharPrint('∞°','≥™');
		// run() ¿∏∑Œ »£√‚«œ¥¬ ∞Õ¿∫ π´¿«πÃ«œ¥Ÿ.		

		t1.start(); // æ≤∑πµÂ ∞°µø(∫¥∑ƒ¿˚¿∏∑Œ √≥∏Æ«“ µ∂∏≥¿€æ˜¿ª Ω√¿€Ω√≈∞¥¬)
		for (int cnt = 1; cnt <=10 ; cnt++) {
			System.out.println("-");
		}
		Thread t2 =new CharPrint('≥™', '¥Ÿ');
		t2.start();
		
	//	t1.stop(); //«œ¡ˆ∏∂∂Û∂Û∞Ì deprecated ∫Ò√ﬂ√µ µ«æÓ¿÷¥Ÿ
		
		//«¡∑Œ±◊∑• »Â∏ß¿∫ mainø°º≠ ¡¯«‡«œ¥¬ ∏µÁ æ≤∑πµÂ∞° ¡æ∑·«ÿæﬂ «¡∑Œ±◊∑•¿Ã ¡æ∑·∞° µ»¥Ÿ.
		
		
		// ¡¢º”«— ªÁøÎ¿⁄∏¶ √≥∏Æ«“ ∞¥√º∏¶ ∏∏µÂ¥¬∞Õ
		
		// ±‚¡∏ 2¡ﬂπ›∫π (accept ( read,control,write))
	}
}
/*
-
-
-
-
-
-
-
-
-
-
Thread-0 : ∞°∞¢ÅAÅB∞£ÅCÅD∞§∞•∞¶∞ßÅEÅFÅGÅHÅI∞®∞©∞™∞´
Thread-0 : ∞¨∞≠∞Æ∞ØÅJ∞∞∞±∞≤∞≥∞¥ÅKÅL∞µÅMÅNÅO∞∂ÅPÅQÅR
Thread-0 : ÅSÅTÅUÅV∞∑∞∏ÅW∞π∞∫∞ªÅXÅYÅZÅaÅbÅc∞º∞ΩÅdÅe
Thread-0 : ∞æÅfÅgÅh∞øÅiÅjÅkÅlÅmÅnÅoÅpÅqÅr∞¿Ås∞¡ÅtÅu
Thread-0 : ÅvÅwÅxÅy∞¬ÅzÅÅÅÇ∞√ÅÉÅÑÅÖ∞ƒÅÜÅáÅàÅâÅäÅãÅå
Thread-0 : ÅçÅéÅèÅêÅëÅíÅìÅîÅïÅñÅóÅò∞≈∞∆ÅôÅö∞«ÅõÅú∞»
Thread-1 : ≥™≥´≥¨Ö˙≥≠Ö˚Ö¸≥Æ≥Ø≥∞≥±Ö˝Ö˛ÜAÜBÜC≥≤≥≥ÜD≥¥
Thread-0 : ∞…Åù∞ ÅûÅüÅ†Å°Å¢∞À∞ÃÅ£∞Õ∞Œ∞œ∞–Å§Å•∞—∞“∞”
Thread-1 : ≥µ≥∂≥∑≥∏ÜE≥πÜF≥∫≥ª≥ºÜGÜH≥ΩÜIÜJÜK≥æÜLÜMÜN
Thread-0 : ∞‘Å¶ÅßÅ®∞’Å©Å™Å´∞÷Å¨Å≠ÅÆÅØÅ∞Å±Å≤∞◊∞ÿÅ≥∞Ÿ
Thread-1 : ÜOÜPÜQÜR≥ø≥¿ÜS≥¡≥¬≥√ÜTÜUÜVÜWÜXÜY≥ƒ≥≈ÜZÜa
Thread-0 : ∞⁄∞€Å¥ÅµÅ∂Å∑Å∏Åπ∞‹∞›∞ﬁÅ∫∞ﬂÅªÅº∞‡∞·ÅΩÅæÅø
Thread-1 : ≥∆ÜbÜcÜd≥«ÜeÜfÜgÜhÜiÜjÜk≥»ÜlÜmÜnÜo≥…ÜpÜq
Thread-1 : ÜrÜsÜtÜuÜvÜwÜxÜyÜzÜÅÜÇÜÉÜÑÜÖÜÜÜáÜàÜâÜäÜã
Thread-1 : ÜåÜçÜéÜèÜêÜëÜíÜìÜîÜïÜñÜó≥ ≥ÀÜò≥Ã≥ÕÜôÜöÜõ
Thread-1 : ≥ŒÜú≥œ≥–ÜùÜûÜüÜ†≥—≥“Ü°≥”≥‘≥’Ü¢Ü£Ü§Ü•Ü¶≥÷
Thread-1 : ≥◊≥ÿÜßÜ®≥ŸÜ©Ü™Ü´≥⁄Ü¨Ü≠ÜÆÜØÜ∞Ü±Ü≤≥€≥‹Ü≥≥›
Thread-0 : Å¿Å¡Å¬Å√∞‚∞„Åƒ∞‰∞Â∞ÊÅ≈Å∆Å«∞ÁÅ»Å…∞ËÅ ÅÀÅÃ
Thread-1 : ≥ﬁ≥ﬂÜ¥ÜµÜ∂Ü∑Ü∏Üπ≥‡≥·Ü∫Üª≥‚ÜºÜΩÜæ≥„ÜøÜ¿Ü¡
Thread-0 : ∞ÈÅÕÅŒÅœ∞ÍÅ–Å—Å“Å”Å‘Å’Å÷Å◊∞ÎÅÿ∞ÏÅŸÅ⁄Å€Å‹
Thread-1 : Ü¬Ü√ÜƒÜ≈≥‰≥ÂÜ∆Ü«≥Ê≥ÁÜ»Ü…≥ËÜ ÜÀÜÃ≥ÈÜÕÜŒÜœ
Thread-0 : Å›ÅﬁÅﬂÅ‡∞Ì∞ÓÅ·Å‚∞ÔÅ„Å‰∞∞ÒÅÂ∞ÚÅÊ∞ÛÅÁÅË∞Ù
Thread-1 : ≥ÍÜ–Ü—Ü“Ü”Ü‘Ü’Ü÷Ü◊ÜÿÜŸÜ⁄Ü€Ü‹Ü›ÜﬁÜﬂÜ‡Ü·Ü‚
Thread-0 : ∞ı∞ˆÅÈ∞˜ÅÍ∞¯∞˘ÅÎÅÏÅÌÅÓÅÔ∞˙∞˚ÅÅÒ∞¸ÅÚÅÛÅÙ
Thread-0 : ∞˝Åı∞˛ÅˆÅ˜Å¯Å˘Å˙±°±¢Å˚±£Å¸±§Å˝Å˛ÇAÇBÇCÇD
Thread-1 : Ü„Ü‰ÜÂÜÊ≥Î≥ÏÜÁÜË≥ÌÜÈÜÍÜÎ≥ÓÜÏ≥ÔÜÌÜÓÜÔÜÜÒ
Thread-1 : ≥≥ÒÜÚ≥ÚÜÛ≥ÛÜÙÜıÜˆÜ˜≥Ù≥ı≥ˆÜ¯Ü˘Ü˙≥˜Ü˚Ü¸Ü˝
Thread-0 : ±•ÇEÇFÇG±¶ÇHÇIÇJ±ßÇKÇLÇMÇNÇOÇPÇQÇR±®ÇSÇT
Thread-1 : ≥¯Ü˛áAáBáCáDáEáFáGáHáIáJ≥˘áKáLáMáNáOáPáQ
Thread-0 : ±©±™ÇUÇVÇWÇXÇYÇZ±´±¨ÇaÇb±≠ÇcÇdÇe±ÆÇfÇgÇh
Thread-1 : áRáSáTáUáVáWáXáYáZáaábácádáeáfágáháiáják
Thread-1 : álámánáoápáqárás≥˙átáuáv≥˚áwáxáy≥¸ázáÅáÇ
Thread-0 : ÇiÇjÇkÇl±Ø±∞Çm±±Çn±≤ÇoÇpÇqÇrÇsÇt±≥ÇuÇvÇw
Thread-1 : áÉáÑáÖáÜ≥˝≥˛áá¥°áàáâáäáãáåáçáéáè¥¢¥£áêáë
Thread-0 : ±¥ÇxÇyÇz±µÇÅÇÇÇÉÇÑÇÖÇÜÇáÇà±∂Çâ±∑ÇäÇãÇåÇç
Thread-1 : ¥§áíáìáî¥•áïáñáóáòáôáöáõáú¥¶áù¥ßáû¥®áüá†
Thread-1 : á°á¢á£á§¥©¥™á•á¶¥´áßá®¥¨¥≠á©á™á´á¨á≠áÆáØ
Thread-1 : ¥Æ¥Øá∞¥∞á±¥±á≤á≥á¥áµá∂á∑¥≤á∏áπá∫áªáºáΩáæ
Thread-1 : áøá¿á¡á¬á√áƒá≈á∆á«á»á…á ¥≥áÀáÃáÕáŒáœá–á—
Thread-1 : ¥¥á“á”á‘á’á÷á◊áÿáŸá⁄á€á‹á›áﬁáﬂá‡á·á‚á„á‰
Thread-1 : áÂáÊáÁáËáÈáÍáÎáÏ¥µáÌáÓáÔ¥∂ááÒáÚ¥∑áÛáÙáı
Thread-1 : áˆá˜á¯á˘¥∏¥πá˙á˚á¸á˝á˛àAàBàCàDàE¥∫¥ªàFàG
Thread-1 : àHàIàJàK¥ºàLàMàNàOàPàQàR¥Ω¥æàSàTàU¥øàVàW
Thread-1 : àXàYàZàa¥¿¥¡àbàc¥¬àdàeàf¥√¥ƒ¥≈àgàhàiàjàk
Thread-1 : ¥∆¥«àl¥»àm¥…¥ ànàoàp¥Ààq¥Ãàràsàt¥Õàuàvàw
Thread-1 : ¥ŒàxàyàzàÅàÇàÉàÑàÖàÜàáàààâàäàãàåàçàéàèàê
Thread-1 : ¥œ¥–àëàí¥—àìàîàï¥“àñ¥”àóàòàôàöàõ¥‘¥’àú¥÷
Thread-1 : àù¥◊àûàüà†à°¥ÿà¢
Thread-0 : ÇéÇèÇêÇë±∏±πÇíÇì±∫ÇîÇï±ª±º±Ω±æÇñÇóÇòÇô±ø
Thread-0 : ±¿±¡Çö±¬Çõ±√±ƒÇúÇùÇûÇüÇ†±≈±∆Ç°Ç¢±«Ç£Ç§Ç•
Thread-0 : ±»Ç¶ÇßÇ®Ç©Ç™Ç´Ç¨Ç≠ÇÆÇØÇ∞±…± Ç±Ç≤Ç≥Ç¥ÇµÇ∂
Thread-0 : ±ÀÇ∑Ç∏ÇπÇ∫ÇªÇºÇΩÇæÇøÇ¿Ç¡Ç¬Ç√ÇƒÇ≈Ç∆Ç«Ç»±Ã
Thread-0 : Ç…Ç ÇÀÇÃÇÕÇŒÇœÇ–±Õ±ŒÇ—Ç“±œÇ”Ç‘Ç’±–Ç÷Ç◊Çÿ
Thread-0 : ÇŸÇ⁄Ç€Ç‹±—±“Ç›±”ÇﬁÇﬂÇ‡Ç·Ç‚Ç„Ç‰ÇÂ±‘ÇÊÇÁÇË
Thread-0 : ±’ÇÈÇÍÇÎ±÷ÇÏÇÌÇÓÇÔÇÇÒÇÚÇÛÇÙÇıÇˆÇ˜Ç¯Ç˘Ç˙
Thread-0 : Ç˚Ç¸Ç˝Ç˛±◊±ÿÉAÉB±ŸÉCÉD±⁄±€±‹ÉEÉFÉGÉHÉIÉJ
Thread-0 : ±›±ﬁÉK±ﬂÉL±‡ÉMÉNÉOÉPÉQÉR±·ÉSÉTÉUÉVÉWÉXÉY
Thread-0 : ÉZÉaÉbÉcÉdÉeÉfÉgÉhÉiÉjÉkÉlÉmÉnÉoÉpÉqÉrÉs
Thread-0 : ±‚±„ÉtÉu±‰ÉvÉw±Â±ÊÉx±ÁÉyÉzÉÅÉÇÉÉ±Ë±ÈÉÑ±Í
Thread-0 : ÉÖ±Î±ÏÉÜÉáÉà±ÌÉâ±Ó±Ô±Éä±ÒÉãÉåÉç±ÚÉé±ÛÉè
Thread-0 : ÉêÉëÉíÉì±Ù±ıÉî±ˆ±˜±¯ÉïÉñÉó±˘ÉòÉô±˙±˚ÉöÉõ
Thread-0 : ±¸ÉúÉùÉû±˝ÉüÉ†É°É¢É£É§É•±˛≤°É¶≤¢≤£≤§ÉßÉ®
Thread-0 : É©É™É´É¨≤•≤¶É≠ÉÆÉØÉ∞É±É≤≤ßÉ≥É¥ÉµÉ∂É∑É∏Éπ
Thread-0 : É∫ÉªÉºÉΩÉæÉøÉ¿É¡É¬É√ÉƒÉ≈É∆É«É»É…É ÉÀÉÃÉÕ
Thread-0 : ÉŒÉœÉ–É—É“É”É‘É’É÷É◊ÉÿÉŸÉ⁄É€É‹É›ÉﬁÉﬂÉ‡É·
Thread-0 : ≤®≤©≤™É‚≤´É„É‰ÉÂ≤¨ÉÊÉÁÉËÉÈÉÍÉÎÉÏ≤≠≤ÆÉÌ≤Ø
Thread-0 : ≤∞≤±ÉÓÉÔÉÉÒÉÚÉÛ≤≤≤≥ÉÙÉı≤¥ÉˆÉ˜É¯É˘É˙É˚É¸
Thread-0 : É˝É˛ÑAÑB≤µÑCÑD≤∂ÑE≤∑ÑFÑGÑHÑIÑJÑK≤∏ÑLÑMÑN
Thread-0 : ≤πÑOÑPÑQ≤∫ÑRÑSÑTÑUÑVÑWÑXÑYÑZÑa≤ª≤ºÑbÑcÑd
Thread-0 : Ñe≤ΩÑfÑg≤æÑhÑiÑjÑkÑlÑmÑnÑoÑpÑqÑrÑsÑtÑuÑv
Thread-0 : ÑwÑxÑyÑzÑÅÑÇÑÉÑÑÑÖÑÜÑáÑà≤ø≤¿ÑâÑä≤¡Ñã≤¬Ñå
Thread-0 : ≤√ÑçÑéÑèÑêÑëÑíÑì≤ƒ≤≈Ñî≤∆Ñï≤«≤»≤…ÑñÑóÑòÑô
Thread-0 : ≤ ≤ÀÑöÑõÑúÑùÑûÑü≤ÃÑ†Ñ°Ñ¢Ñ£Ñ§Ñ•Ñ¶ÑßÑ®Ñ©Ñ™
Thread-0 : ≤Õ≤ŒÑ´Ñ¨Ñ≠ÑÆÑØÑ∞≤œ≤–Ñ±Ñ≤Ñ≥Ñ¥ÑµÑ∂Ñ∑Ñ∏ÑπÑ∫
Thread-0 : ÑªÑºÑΩÑæÑøÑ¿Ñ¡Ñ¬Ñ√≤—ÑƒÑ≈Ñ∆Ñ«Ñ»Ñ…≤“Ñ ÑÀÑÃ
Thread-0 : ≤”ÑÕÑŒÑœ≤‘Ñ–Ñ—Ñ“Ñ”Ñ‘Ñ’Ñ÷≤’≤÷Ñ◊ÑÿÑŸ≤◊Ñ⁄Ñ€
Thread-0 : Ñ‹Ñ›ÑﬁÑﬂ≤ÿÑ‡Ñ·Ñ‚Ñ„Ñ‰ÑÂÑÊÑÁÑËÑÈÑÍÑÎÑÏÑÌÑÓ
Thread-0 : ÑÔÑÑÒÑÚÑÛÑÙÑıÑˆÑ˜Ñ¯Ñ˘Ñ˙≤Ÿ≤⁄Ñ˚Ñ¸≤€Ñ˝Ñ˛ÖA
Thread-0 : ≤‹ÖBÖCÖDÖEÖFÖG≤›≤ﬁ≤ﬂÖH≤‡ÖI≤·≤‚ÖJÖKÖLÖMÖN
Thread-0 : ≤„ÖOÖPÖQÖRÖSÖTÖU≤‰ÖVÖWÖXÖYÖZÖaÖbÖcÖdÖeÖf
Thread-0 : ≤Â≤ÊÖgÖhÖiÖjÖkÖl≤Á≤ËÖmÖn≤ÈÖoÖpÖq≤ÍÖrÖsÖt
Thread-0 : ÖuÖvÖwÖx≤Î≤ÏÖyÖz≤ÌÖÅÖÇÖÉÖÑÖÖÖÜÖá≤ÓÖàÖâÖä
Thread-0 : ≤ÔÖãÖåÖç≤ÖéÖèÖêÖëÖíÖìÖî≤Ò≤ÚÖïÖñÖóÖòÖôÖö
Thread-0 : ÖõÖúÖùÖû≤ÛÖüÖ†Ö°Ö¢Ö£Ö§Ö•Ö¶ÖßÖ®Ö©Ö™Ö´Ö¨Ö≠
Thread-0 : ÖÆÖØÖ∞Ö±Ö≤Ö≥Ö¥ÖµÖ∂Ö∑Ö∏Öπ≤Ù≤ıÖ∫Öª≤ˆÖº≤˜ÖΩ
Thread-0 : ≤¯Öæ≤˘ÖøÖ¿Ö¡Ö¬≤˙≤˚≤¸Ö√≤˝Öƒ≤˛Ö≈Ö∆Ö«≥°Ö»Ö…
Thread-0 : Ö ÖÀÖÃÖÕÖŒÖœÖ–Ö—Ö“Ö”Ö‘Ö’Ö÷Ö◊ÖÿÖŸÖ⁄Ö€Ö‹Ö›
Thread-0 : ÖﬁÖﬂÖ‡Ö·Ö‚Ö„Ö‰ÖÂ≥¢≥£ÖÊÖÁ≥§ÖËÖÈÖÍ≥•ÖÎÖÏÖÌ
Thread-0 : ÖÓÖÔÖÖÒ≥¶≥ßÖÚ≥®ÖÛ≥©ÖÙÖıÖˆÖ˜Ö¯Ö˘
*/