<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>

<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>  [guestJoin.jsp] </title>

 <style type="text/css">
    *{font-size:14pt; font-weight:bold;  font-family: Comic Sans MS ; }
    a{font-size:14pt; font-weight:bold; color:blue; text-decoration:none; }
{font-size:20pt; font-weight:bold; color:green; text-decoration:underline; }                
  </style>

<script type="text/javascript">
	function check2() {
	}//check end 회원가입 정보들 누락건 있는지
	
	function checkid_all() {
		
	}//checkid all
</script>
</head>

<jsp:include page="top.jsp"></jsp:include>
<body>
<form class="join_pa" name="join_in" method="post" >
	<div class="text_ar" ><br><br>
		<div><strong>이용약관동의</strong><br><br></div>
		<textarea rows="12" cols="140" 	readonly="readonly" style="resize: none; ">
제 1장 총칙

◆ 제 1조 [목적]

이 약관은 프비캠을 운영하는 프아뱅캠 (이하 "프아뱅캠"이라 한다)에서 제공하는 인터넷 관련 서비스(이하 "서비스"라 한다)를 이용함에 있어 사이트와 이용자의 권리·의무 및 책임사항을 규정함을 목적으로 합니다. 

◆ 제 2조 [정의]

① 프아뱅캠 이란 프아뱅캠 재화 또는 용역을 이용자에게 제공하기 위하여 컴퓨터등 정보통신설비를 이용하여 재화 또는 용역을 거래할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 사이트를 운영하는 사업자의 의미로도 사용합니다.
② 이용자 란 프아뱅캠에 접속하여 이 약관에 따라 프아뱅캠의 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
③ 회원이라 함은 프아뱅캠에 개인정보를 제공하여 회원등록을 한 자로서, 프아뱅캠의 정보를 지속적으로 제공받으며, 프아뱅캠이 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
④ 비회원이라 함은 회원에 가입하지 않고 프아뱅캠이 제공하는 서비스를 이용하는 자를 말합니다. 

◆ 제3조 [약관의 명시와 개정] 

① 프아뱅캠은 이 약관의 내용과 상호, 이메일 등을 이용자가 알 수 있도록 프아뱅캠의 초기 서비스화면(전면)에 게시합니다.

◆ 제4조 [서비스의 중단] 

① 프아뱅캠은 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
② 제1항에 의한 서비스 중단의 경우에는 프아뱅캠은 제8조에 정한 방법으로 이용자에게 통지합니다.
③ 프아뱅캠 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상하지 아니합니다. 단 프아뱅캠의 고의 또는 과실이 있는 경우에는 그러하지 아니합니다.

제 2장 회원 가입 계약
◆ 제5조 [회원가입]

① 이용자는 프아뱅캠이 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.
② 프아뱅캠은 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각호에 해당하지 않는 한 회원으로 등록합니다.

1. 가입신청자가 이 약관 제7조제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 다만 제7조제3항에 의한 회원자격 상실 후 3년이 경과한 자로서 프아뱅캠의 회원재가입 승낙을 얻은 경우에는 예외로 한다.
2. 등록 내용에 허위, 기재 누락, 오기가 있는 경우
3. 기타 회원으로 등록하는 것이 프아뱅캠의 기술상 현저히 지장이 있다고 판단되는 경우

③ 회원가입계약의 성립시기는 프아뱅캠의 승낙이 회원에게 도달한 시점으로 합니다.
④ 회원은 제15조제1항에 의한 등록사항에 변경이 있는 경우, 즉시 전자우편 기타 방법으로 프아뱅캠에 대하여 그 변경사항을 알려야 합니다.

◆ 제6조 [회원 탈퇴 및 자격 상실 등]

① 회원은 프아뱅캠에 언제든지 탈퇴를 요청할 수 있으며 프아뱅캠은 즉시 회원탈퇴를 처리합니다.
② 회원이 다음 각호의 사유에 해당하는 경우, 프아뱅캠은 회원자격을 제한 및 정지시킬 수 있습니다.

1. 가입 신청시에 허위 내용을 등록한 경우
2. 프아뱅캠을 이용하여 구입한 재화·용역 등의 대금, 기타 프아뱅캠은 이용에 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우
3. 다른 사람의 프아뱅캠 이용을 방해하거나 그 정보를 도용하는 등전자거래질서를 위협하는 경우
4. 프아뱅캠을 이용하여 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우

③ 프아뱅캠은 회원 자격을 제한·정지 시킨 후, 동일한 행위가 2회이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 프아뱅캠은 회원자격을 상실시킬 수 있습니다.
④ 프아뱅캠은 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 소명할 기회를 부여합니다.

제 3장 프아뱅캠과 이용자의 의무사항 

◆ 제7조 [개인정보보호]

① 프아뱅캠은 이용자의 정보수집시 구매계약 이행에 필요한 최소한의 정보를 수집합니다. 

   가입페이지
   1. 아이디
   2. 패스워드/패스워드 확인
   3. 이름
   4. 생년월일
   5. 성별
   6. 주소
   7. 연락처
   8.이메일

② 프아뱅캠은 이용자의 개인식별이 가능한 개인정보를 수집하는 때에는 반드시 당해 이용자의 동의를 받습니다.
③ 제공된 개인정보는 당해 이용자의 동의없이 목적외의 이용이나 제3자에게 제공할 수 없으며, 이에 대한 모든 책임은 프아뱅캠은 집니다. 다만,  다음의 경우에는 예외로 합니다.
④ 프아뱅캠은 제2항과 제3항에 의해 이용자의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속, 성명 및 전화번호 기타 연락처),정보의 수집목적 및 이용목적, 제3자에 대한 정보제공 관련사항 (제공받는자, 제공목적 및 제공할 정보의 내용)등 정보통신망이용촉진등에관한법률 제16조제3항이 규정한 사항을 미리 명시하거나 고지해야 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.
⑤ 이용자는 언제든지 프아뱅캠은 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을 요구할 수 있으며 프아뱅캠은 이에 대해 지체없이 필요한 조치를 취할 의무를 집니다. 이용자가 오류의 정정을 요구한 경우에는 프아뱅캠은 그 오류를 정정할 때까지 당해 개인정보를 이용하지 않습니다.
⑥ 프아뱅캠은 개인정보 보호를 위하여 관리자를 한정하여 그 수를 최소화하며 신용카드, 은행계좌 등을 포함한 이용자의 개인정보의 분실, 도난, 유출, 변조 등으로 인한 이용자의 손해에 대하여 모든 책임을  집니다.
⑦ 프아뱅캠 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체없이 파기합니다.

◆ 제8조 [프아뱅캠의 의무]

① 프아뱅캠은 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화·용역을 제공하는 데 최선을 다하여야 합니다.
② 프아뱅캠은 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보 (신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.
③ 프아뱅캠은 상품이나 용역에 대하여 「표시·광고의공정화에관한법률」제 3 조 소정의 부당한 표시·광고행위를 함으로써 이용자가 손해를 입은 때에는 이를 배상할 책임을 집니다.
④ 프아뱅캠은 이용자가 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.

◆ 제9조 [회원의 ID 및 비밀번호에 대한 의무]

① 제15조의 경우를 제외한 ID와 비밀번호에 관한 관리책임은 회원에게 있습니다.
② 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
③ 회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 프아뱅캠에 통보하고 프아뱅캠의 안내가 있는 경우에는 그에 따라야 합니다.

◆ 제10조 [이용자의 의무]

① 이용자는 다음 행위를 하여서는 안됩니다.

1. 회원가입신청 또는 변경시 허위내용을 등록하는 행위
2. 프아뱅캠에 게시된 정보를 변경 또는 해킹하는 행위
3. 프아뱅캠은 정한 정보 이외의 정보(컴퓨터 프로그램 등)의 송신 또는 게시
4. 프아뱅캠 기타 제3자의 저작권 등 지적재산권에 대한 침해
5. 프아뱅캠 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
6. 외설 또는 폭력적인 메시지·화상·음성 기타 공서양속에 반하는 정보를 사이트에 공개 또는 게시하는 행위
7. 프아뱅캠은 제공하는 서비스에 정한 약관 기타 서비스 이용에 관한 규정을 위반하는 행위

② 전항 각호의 정보 기타 프아뱅캠은 사이트 운영상 부적절하다고 판단한 정보가 사이트에 게시되거나 사이트와 링크된 곳에 게시된 경우, 프아뱅캠은 이용자 기타 정보의 게시를 행한 자의 승낙없이 프아뱅캠에 게재된 당해 정보를 삭제하거나 사이트에 확장된 링크를 절단할 수 있습니다. 단, 프아뱅캠은 이러한 정보의 삭제˙링크의 절단 등을 할 의무를 지지 않습니다.

제 4장 기타

◆ 제11조 [저작권의 귀속 및 이용제한]

① 프아뱅캠은 온라인, 웹, 홈페이지, 카페, 블로그 등에서 퍼온 저작물에 대해선 해당 저작권자에게 저작권이 있습니다.
② 프아뱅캠의 저작권이 아닌 경우, 저작권자의 삭제요청시 게시물을 삭제합니다.(사이트 메인 하단에 "저작권침해신고")

◆ 제12조 [면책사항]

① 프아뱅캠은 이용자가 회사의 서비스 제공으로부터 기대되는 이익을 얻지 못하였거나 서비스 자료에 대한 취사선택 또는 이용으로 발생하는 손해등에 대해서는 책임지지 아니합니다.
② 프아뱅캠은 이용자의 귀책사유로 인하여 서비스 이용의 장애가 발생한 경우에는 책임지지 아니합니다.
③ 프아뱅캠은 이용자가 게시 또는 전송한 자료 및 본 서비스로부터 이용고객이 제공받을 수 있는 모든 자료들의 진위, 신뢰도, 정확성 등 그 내용에 대해서는 책임지지 아니합니다.
④ 프아뱅캠은 이용자가 상호간 또는 이용고객과 제3자 상호간에 서비스를 매개로 하여 물품거래등을 한 경우에 그로부터 발생하는 일체의 손해에 대하여 책임지지 아니합니다.
⑤ 프아뱅캠은 프아뱅캠의 귀책사유 없이 이용고객간 또는 이용고객과 제3자간에 발생한 일체의 분쟁에 대하여 책임지지 아니합니다.

◆ 제13조 [분쟁해결]

① 프아뱅캠은 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리하기 위하여 피해보상처리기구를 설치·운영합니다.
② 프아뱅캠은 이용자로부터 제출되는 불만사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시 통보해 드립니다.
③ 프아뱅캠과 이용자간에 발생한 분쟁은 전자거래기본법 제28조 및 동 시행령 제15조에 의하여 설치된 전자거래분쟁조정위원회의 조정에 따를 수 있습니다.

◆ 제14조 [재판권 및 준거법]

① 프아뱅캠과 이용자간에 발생한 전자거래 분쟁에 관한 소송은 민사소송법상의 프아뱅캠의 당·관할법원에 제기할 수 있습니다.
② 프아뱅캠과 이용자간에 제기된 전자거래 소송에는 대한민국법을 적용합니다. 

    [부칙]

프아뱅캠의 이용약관은 2017년 01월 14일부터 시행합니다.

※ 본 약관은 프아뱅캠의 이용약관이며, 약관에 대한 저작권은 
프아뱅캠 회사에 귀속 되어습니다. 무단 복제 및 참조, 배포, 기타 저작권의 
침해행위를 금지합니다.
</textarea>
		<br><br>
		<div> 회원가입약관의 내용에 동의합니다.&nbsp;&nbsp;
		<input type="checkbox" id="text1" name="chk" value="1" >
		</div><br><br>
		
		<strong>개인정보처리방침안내</strong><br><br>
		<textarea rows="12" cols="140" 	readonly="readonly" style="resize: none;">
총 칙

프아뱅캠(이하 ‘회사’라 함)는 회원의 개인정보 보호를 매우 중요시하며, 『정보통신망 이용촉진 및 정보보호 등에 관한 법률』 및 전기통신사업법, 통신비밀보호법을 준수하고 있습니다.
회사는 개인정보취급방침을 수립하여 회원의 개인정보를 보호하고 있으며, 이를 홈페이지에 명시하여 회원이 온라인상에서 회사에 제공한 개인정보가 어떠한 용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치를 취하는지 알려드립니다.
회사의 개인정보취급방침은 다음과 같은 내용을 담고 있습니다.

1. 개인정보 수집 및 이용목적
프아뱅캠의 개인 정보 수집은 최초 회원 가입등록시 기본약관을 통해 수집되며수집된 개인 정보는 다양한 프아뱅캠 컨텐츠의 맞춤 서비스로 더욱 적절하고 유용한 서비스를 제공하기 위함과 수집된 내용을 바탕으로 더욱더 좋은 서비스로 노력하기 위해서 입니다.

2. 수집하는 개인정보 항목과 수집방법

프아뱅캠 최초 회원 가입 등록시 기본 회원 정보는 (아이디,이름,패스워드,이메일)등 입니다.
개인정보보호를 위하여 (주민등록번호)는 일체 받지않습니다.

프아뱅캠의 서비스 유료 컨텐츠 및 이벤트를 제공 받기 위해서는 추가적인 정보기재를 요청할 수 있으며 위의 정보 이상으로 개인 프라이버시 침해에 해당하는 정보는 요청하지 않으며 다른 어떠한 목적으로 사용되지 않음을 알려드립니다.

3.개인정보의 보유 및 이용기간

원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 아래와 같이 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다.

보존 항목 : 로그인ID
보존 근거 : 신용정보의 이용 및 보호에 관한 법률

표시/광고에 관한 기록 : 6개월 (전자상거래등에서의 소비자보호에 관한 법률)
계약 또는 청약철회 등에 관한 기록 : 5년 (전자상거래등에서의 소비자보호에 관한 법률)
대금결제 및 재화 등의 공급에 관한 기록 : 5년 (전자상거래등에서의 소비자보호에 관한 법률)
소비자의 불만 또는 분쟁처리에 관한 기록 : 3년 (전자상거래등에서의 소비자보호에 관한 법률)
신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년 (신용정보의 이용 및 보호에 관한 법률)

4.개인정보의 파기절차 및 방법

회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.


ο 파기절차

회원님이 회원가입 등을 위해 입력하신 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기되어집니다.

별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되어지는 이외의 다른 목적으로 이용되지 않습니다.

ο 파기방법

- 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다. 

5. 개인정보보호 관련 기술적/관리적 대책 
회원의 개인정보는 기본적으로 회원의 아이디와 비밀번호에 의하여 보호되며, 회사는 회원의 개인정보를 취급함에 있어 개인정보가 유출, 변조 또는 훼손되지 않도록 안전성을 확보하기 위하여 다음과 같은 기술적/관리적 대책을 마련하고 있습니다. 

1. 기술적 대책 

① 회원 계정의 비밀번호는 암호화되어 저장되므로 본인만이 알 수 있습니다. 따라서 계정 로그인이 필요한 개인정보의 확인 및 수정은 해당 아이디와 비밀번호를 알고 있는 본인 만이 가능합니다. 
② 회사는 개인정보의 훼손에 대비하여 자료를 수시로 백업하고 있고, 최신 백신프로그램을 이용하여 컴퓨터 바이러스 등에 의해 회원들의 개인정보나 자료가 누출되거나 손상되지 않도록 방지하고 있습니다. 
③ 회사는 결제 등의 경우에 있어 네트워크상에서 개인정보를 안전하게 전송할 수 있도록 보안장치를 채택하고 있습니다. 
④ 회사는 해킹 등에 의한 정보의 유출을 방지하기 위해 침입차단시스템(방화벽)을 이용하여 외부로부터의 무단 접근을 통제하고 있으며, 기타 시스템적인 보안성을 확보하기 위해 가능한 모든 기술적 장치를 갖추려 노력하고 있습니다.

2. 관리적 대책 
① 회사는 회원 본인의 비밀번호 요청 등에 의해 개인정보를 다룰 때 가능한 최선의 방법으로 본인임을 확인하고 안전하게 정보가 처리될 수 있도록 최선을 다합니다. 
② 회사는 개인정보에 대한 접근권한을 개인정보관리책임자 등 개인정보관리업무를 수행하는 자, 기타 업무상 개인정보의 취급이 불가피한 자로 제한하며, 개인정보를 취급하는 직원에 대한 수시 교육을 통하여 개인정보취급방침의 준수를 항상 강조하고 있습니다. 

위와 같은 회사의 노력 이외에 회원은 아이디와 비밀번호, 주민등록번호 등 개인정보가 인터넷 상에 노출되거나 타인에게 유출되지 않도록 주의하여야 합니다. 회원 본인의 부주의나 관리소홀로 아이디와 비밀번호 등 개인정보가 유출되었다면 이에 대해서 회사는 책임을 지지 않습니다. 
따라서, 회원의 아이디와 비밀번호는 반드시 본인만 사용하시고, 비밀번호를 자주 바꿔주시는 것이 좋으며, 비밀번호는 영문자, 숫자를 혼합하여 타인이 유추하기 어려운 번호를 사용하는 것이 좋습니다. 
또한 서비스의 이용을 마친 후에는 항상 로그아웃을 하여 주시고 웹 브라우저를 종료하는 것이 좋습니다. 특히, 다른 사람과 컴퓨터를 공유하거나, 공공장소에서 이용하는 경우에 개인정보의 보안을 위해서는 이와 같은 절차가 더욱 필요합니다.

6. 개인정보 관리 책임자 및 담당자 
회사는 회원의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 개인정보 관리 책임자 및 담당자를 지정하고 있습니다. 
개인정보 관리 담당자 

귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리 책임자 혹은 담당자에게 연락하시기 바랍니다. 회사는 회원의 문의사항에 대해 신속하게 충분한 답변을 드릴 것입니다. 

7. 개인정보관련 신고 및 분쟁조정 
개인정보침해에 대한 신고 또는 상담이 필요하신 경우에는 한국정보보호진흥원(KISA) 개인정보침해신고센터로 문의하시기 바랍니다. 또한, 귀하가 개인정보침해를 통한 금전적, 정신적 피해를 입으신 경우에는 한국정보보호진흥원(KISA) 개인정보분쟁조정위원회에 피해구제를 신청하실 수 있습니다. 
개인정보 침해신고센터 (http://www.cyberprivacy.or.kr, 전화 1336) 
개인정보 분쟁조정위원회 (http://www.kopico.or.kr, 전화 1336) 
정보보호마크 인증위원회 (http://www.privacymark.or.kr, 전화 02-580-0533) 
대검찰청 인터넷범죄수사센터 (http://www.spo.go.kr, 전화 02-3480-3600) 
경찰청 사이버테러대응센터 (http://www.ctrc.go.kr, 전화 02-392-0330) 
경찰청 (http://www.police.go.kr)

8. 정책변경에 따른 고지의 의무 
법령, 정책 또는 보안기술 등의 변경에 따라 현 개인정보취급방침의 내용 추가, 삭제 및 수정이 있을 시에는 개정되는 개인정보취급방침을 시행하기 최소 7일전에 홈페이지의 '공지사항'을 통해 고지할 것입니다.
		
		</textarea>	
			<div> 개인정보 처리방침 안내의 내용에 동의합니다.&nbsp;&nbsp; 
				<input type="checkbox" id="text2" name="chk" value="2">
					</div><br><br><br>
		<div><strong>개인정보 수집 및 이용</strong><br><br></div>			
		<table border="1" class="line_home" >
			<tr class="line_home2">
				<td class="line_home1">구분</td>
				<td class="line_home3">목적</td>
				<td class="line_home4">항목</td>
				<td class="line_home5">보유기간</td>
			</tr>
			<tr class="line_home2">
				<td rowspan="3">필수정보</td>
				<td>회원제 서비스 이용 / 본인확인</td>
				<td>이름, 아이디, 비밀번호, 이메일, 휴대폰, 생일, 성별</td>
				<td rowspan="4">회원탈퇴 후 5일까지</td>
			</tr>
			<tr class="line_home2">
				<td>회원 주문 서비스 이용</td>
				<td>배송에 따른 배송지 정보확인에 이용 이름, 휴대폰, 주소</td>
			</tr>
			<tr class="line_home2">
				<td>마케팅 분석 및 이벤트 참여</td>
				<td>서비스 이용기록, 접속기록, 접속IP정보</td>
			</tr>
			<tr class="line_home2">
				<td>선택정보</td>
				<td>마케팅 활용(이벤트, 맞춤형 광고)</td>
				<td>휴대폰, 이메일, 쿠키정보</td>
			</tr>
		</table>
			</div><br>
			
			<div> 개인정보 수집 및 이용 안내 &nbsp;&nbsp; 
				<input type="checkbox" id="text3" name="chk" value="3" >
			 </div>
				<div>모두 동의하기  &nbsp;&nbsp; 
				<input type="checkbox" id="text4" name="chkAll"onclick="checkid_all()">
				</div>
					
		<div class="join_end"><br>
		<input type="button" value="동의하고 가입하기" class="button" onclick="check2()">&nbsp;&nbsp;
		<a href=./index.jsp><input type="button" value="취소" class="button"></a>
		<br><br>
	</div>
 </form>
</body>
</html>